java/java-jvm.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-16 Sat 09:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>JVM 知识点</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">JVM 知识点</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbea7b48">1. 基础知识</a>
<ul>
<li><a href="#org9d3f814">1.1. JVM 运行内存的分类</a></li>
<li><a href="#org210de8b">1.2. Java 内存堆和栈区别</a></li>
<li><a href="#org921c87c">1.3. Java 四引用</a></li>
<li><a href="#orgb4630f8">1.4. GC 回收机制</a></li>
<li><a href="#orgde6583a">1.5. GC 标记对象的死活</a></li>
<li><a href="#orgfa9e06f">1.6. GC 回收算法</a></li>
<li><a href="#org581c85b">1.7. MinorGC 和 FullGC</a></li>
<li><a href="#orgf3f8351">1.8. 内存分配与回收策略</a></li>
<li><a href="#org850d36b">1.9. GC 垃圾收集器</a></li>
<li><a href="#org368c9fb">1.10. 内存泄漏的几种情形</a></li>
<li><a href="#org0ae0878">1.11. Java 类加载机制</a></li>
<li><a href="#org4f7b260">1.12. 引起类加载操作的五个行为</a></li>
<li><a href="#org7132ce7">1.13. Java 对象创建时机</a></li>
</ul>
</li>
<li><a href="#org09fa631">2. 实践案例</a>
<ul>
<li><a href="#orgabdadaf">2.1. JVM 调优参数</a></li>
<li><a href="#orgb4b89b6">2.2. JDK 调试工具</a>
<ul>
<li><a href="#orgefd2af5">2.2.1. jps</a></li>
<li><a href="#org1c8897e">2.2.2. jstat</a></li>
<li><a href="#org37a54fb">2.2.3. jmap</a></li>
<li><a href="#org1f8b27c">2.2.4. jstack</a></li>
<li><a href="#orgb64fe40">2.2.5. arthas</a></li>
<li><a href="#org6d60285">2.2.6. Eclipse Memory Analyzer</a></li>
</ul>
</li>
<li><a href="#org4266804">2.3. 逃逸分析</a></li>
<li><a href="#orgf60fbb0">2.4. JDBC 知识点</a></li>
</ul>
</li>
<li><a href="#orge3b9764">3. 反射</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgbea7b48" class="outline-2">
<h2 id="orgbea7b48"><span class="section-number-2">1</span> 基础知识</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org9d3f814" class="outline-3">
<h3 id="org9d3f814"><span class="section-number-3">1.1</span> JVM 运行内存的分类</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li><b>程序计数器</b> 当前线程所执行的字节码的行号指示器，用于记录正在执行的虚拟机
字节指令地址，线程私有 注: 如果正在执行的是 Native 方法，计数器值则为空</li>
<li><b>Java 线程栈</b> 存放基本数据类型、对象的引用、方法出口等，线程私有
<ul class="org-ul">
<li>局部变量表</li>
<li>操作数栈</li>
<li>动态链接</li>
<li>方法出口地址</li>
</ul></li>
<li><b>本地方法栈</b> 和线程栈相似，只不过它服务于 Native 方法，线程私有</li>
<li><b>Java 堆</b> Java 内存最大的一块，所有对象实例、数组都存放在 Java 堆，GC 回收
的地方，线程共享</li>
<li><b>元空间</b> 存放已被加载的类信息、常量、静态变量、即时编译器编译后的代码数据
等。（即永久代），回收目标主要是常量池的回收和类型的卸载，各线程共享
<ul class="org-ul">
<li>元空间是 JDK 1.7 之前叫方法区</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org210de8b" class="outline-3">
<h3 id="org210de8b"><span class="section-number-3">1.2</span> Java 内存堆和栈区别</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>栈内存用来存储基本类型的变量和对象的引用变量，堆内存用来存储 Java 中的对象，
无论是成员变量，局部变量，还是类变量，它们指向的对象都存储在堆内存中</li>
<li>栈内存归属于单个线程，每个线程都会有一个栈内存，其存储的变量只能在其所属线
程中可见，即栈内存可以理解成线程的私有内存，堆内存中的对象对所有线程可见。
堆内存中的对象可以被所有线程访问</li>
<li>如果栈内存没有可用的空间存储方法调用和局部变量，JVM 会抛出
<code>java.lang.StackOverFlowError</code>, 如果是堆内存没有可用的空间存储生成的对象，
JVM 会抛出 <code>java.lang.OutOfMemoryError</code></li>
<li>栈的内存要远远小于堆内存，如果你使用递归的话，那么你的栈很快就会充满,
<ul class="org-ul">
<li><code>-Xms&lt;size&gt;</code> set initial Java heap size</li>
<li><code>-Xmx&lt;size&gt;</code> set maximum Java heap size</li>
<li><code>-Xss&lt;size&gt;</code> set java thread stack size</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org921c87c" class="outline-3">
<h3 id="org921c87c"><span class="section-number-3">1.3</span> Java 四引用</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li><b>强引用</b> （StrongReference）强引用是使用最普遍的引用。如果一个对象具有强引
用，那垃圾回收器绝不会回收它。当内存空间不足，Java 虚拟机宁愿抛出
<code>OutOfMemoryError</code> 错误，使程序异常终止，也不会靠随意回收具有强引用的对象
来解决内存不足的问题</li>
<li><b>软引用</b> （SoftReference） 如果内存空间不足了，就会回收这些对象的内存。只
要垃圾回收器没有回收它，软引用可以和一个引用队列（ReferenceQueue）联合使用，
如果软引用所引用的对象被垃圾回收器回收，Java 虚拟机就会把这个软引用加入到
与之关联的引用队列中</li>
<li><b>弱引用</b> （WeakReference） 弱引用与软引用的区别在于: 只具有弱引用的对象拥
有更短暂的生命周期。在垃圾回收器线程扫描它所管辖的内存区域的过程中，一旦发
现了只具有弱引用的对象，不管当前内存空间足够与否，都会回收它的内存。弱引用
可以和一个引用队列（ReferenceQueue）联合使用，如果弱引用所引用的对象被垃圾
回收，Java 虚拟机就会把这个弱引用加入到与之关联的引用队列中</li>
<li><b>虚引用</b> （PhantomReference）虚引用在任何时候都可能被垃圾回收器回收，主要
用来跟踪对象被垃圾回收器回收的活动，被回收时会收到一个系统通知。虚引用与软
引用和弱引用的一个区别在于: 虚引用必须和引用队列 （ReferenceQueue）联合使
用。当垃圾回收器准备回收一个对象时，如果发现它还有虚引用，就会在回收对象的
内存之前，把这个虚引用加入到与之关联的引用队列中</li>
</ol>
</div>
</div>

<div id="outline-container-orgb4630f8" class="outline-3">
<h3 id="orgb4630f8"><span class="section-number-3">1.4</span> GC 回收机制</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li>Java 中对象是采用 <code>new</code> 或者反射的方法创建的，这些对象的创建都是在堆（Heap）
中分配的，所有对象的回收都是由 Java 虚拟机通过垃圾回收机制完成的。GC 为了
能够正确释放对象，会监控每个对象的运行状况，对他们的申请、引用、被引用、赋
值等状 况进行监控</li>
<li>Java 程序员不用担心内存管理，因为垃圾收集器会自动进行管理</li>
<li>可以调用下面的方法之一 <code>System.gc()</code> 或 <code>Runtime.getRuntime().gc()</code> 但 JVM
可以屏蔽掉显示的垃圾回收调用</li>
</ol>
</div>
</div>

<div id="outline-container-orgde6583a" class="outline-3">
<h3 id="orgde6583a"><span class="section-number-3">1.5</span> GC 标记对象的死活</h3>
<div class="outline-text-3" id="text-1-5">
<ol class="org-ol">
<li><b>引用计数法</b> 给对象添加一个引用计数器,没当被引用的时候,计数器的值就加一。
引用失效的时候减一,当计数器的值为 0 的时候就表示改对象可以被 GC 回收了，弊
端: <code>A-&gt;B,B-&gt;A</code>, 那么 AB 将永远不会被回收了。也就是引用有环的情况</li>
<li><b>根搜索算法</b> (可达性算法) GC Roots Tracing: 通过一个叫 GC Roots 的对象作为
起点,从这些结点开始向下搜索,搜索所走过的路径称为引用链,当一个对象没有与任
何的引用链相连的时候则改对象就可以被。 GC 回收回收了 Roots 包括: Java 虚拟
机栈中引用的对象,本地方法栈中引用的对象,方法区中常量引用的对象,方法区中静
态属性引用的对象在 Java 语言里，可作为 GC Roots 的对象包括以下几种:
<ul class="org-ul">
<li>虚拟机栈（栈帧中的本地变量表）中的引用的对象</li>
<li>方法区中的类静态属性引用的对象</li>
<li>方法区中的常量引用的对象</li>
<li>本地方法栈中 JNI(即一般说的 Native 方法)的引用的对象</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgfa9e06f" class="outline-3">
<h3 id="orgfa9e06f"><span class="section-number-3">1.6</span> GC 回收算法</h3>
<div class="outline-text-3" id="text-1-6">
<ol class="org-ol">
<li><b>标记-清除法</b>: 标记出没有用的对象，然后一个一个回收掉
<ul class="org-ul">
<li>缺点: 标记和 清除两个过程效率不高，产生内存碎片导致需要分配较大对象时无
法找到足够的连续内存而需要触发一次 GC 操作</li>
</ul></li>
<li><b>复制回收算法</b>: 按照容量划分二个大小相等的内存区域，当一块用完的时候将活着
的对象复制到另一块上，然后再把已使用的内存空间一次清理掉
<ul class="org-ul">
<li>缺点: 将内存缩小为了原来的一半</li>
</ul></li>
<li><b>标记-整理法</b>: 标记出没有用的对象，让所有存活的对象都向一端移动，然后直接
清除掉端边界以外的内
<ul class="org-ul">
<li>优点: 解决了标记-清除算法导致的内存碎片问题和在存活率较高时复制算法效率
低的问题</li>
</ul></li>
<li><b>分代收集法</b>: 根据对象存活周期的不同将内存划分为几块，一般是新生代和老年代，
新生代基本采用复制算法，老年代采用标记整理算法</li>
</ol>
</div>
</div>

<div id="outline-container-org581c85b" class="outline-3">
<h3 id="org581c85b"><span class="section-number-3">1.7</span> MinorGC 和 FullGC</h3>
<div class="outline-text-3" id="text-1-7">
<ol class="org-ol">
<li><b>Minor GC</b> 通常发生在新生代的 Eden 区，在这个区的对象生存期短，往往发生 GC
的频率较高，回收速度比较快，一般采用复制回收算法</li>
<li><b>Full GC/Major GC</b> 发生在老年代，一般情况下，触发老年代 GC 的时候不会触发
Minor GC，所采用的是标记-清除算法</li>
</ol>
</div>
</div>

<div id="outline-container-orgf3f8351" class="outline-3">
<h3 id="orgf3f8351"><span class="section-number-3">1.8</span> 内存分配与回收策略</h3>
<div class="outline-text-3" id="text-1-8">
<ol class="org-ol">
<li>结构（堆大小 = 新生代(1/3) + 老年代(2/3)）:
<ul class="org-ul">
<li><b>新生代</b>: 初始对象，生命周期短, <code>Eden:s0:s1 = 8:1:1</code></li>
<li><b>老年代</b>: 长时间存在的对象</li>
</ul></li>
<li>一般小型的对象都会在 Eden 区上分配，如果 Eden 区无法分配，那么尝试把活着的
对象放到 survivor0 中去（ <code>Minor GC</code> ）
<ul class="org-ul">
<li>如果 survivor0 可以放入，那么放入之后清除 Eden 区</li>
<li>如果 survivor0 不可以放入，那么尝试把 Eden 和 survivor0 的存活对象放到
survivor1 中
<ul class="org-ul">
<li>如果 survivor1 可以放入，那么放入 survivor1 之后清除 Eden 和 survivor0，
之后再把 survivor1 中的对象复制到 survivor0 中，保持 survivor1 一直为
空。</li>
<li>如果 survivor1 不可以放入，那么直接把它们放入到老年代中，并清除 Eden
和 survivor0，这个过程也称为 <b>分配担保</b> （ <code>Full GC</code> ）</li>
</ul></li>
</ul></li>
<li>大对象、长期存活 (年龄 15 的对象, CMS 收集器默认 6 岁) 的对象则直接进入老
年代</li>
<li>动态对象年龄判定，当进入一批进入 survivor0 对象大小大于等于 survivor0 总内
存 50% 时会直接进入老年代 (可通过 <code>-XX:TargetSurvivorRatio</code> 控制 )</li>
<li>空间分配担保，Full GC</li>
</ol>
</div>
</div>

<div id="outline-container-org850d36b" class="outline-3">
<h3 id="org850d36b"><span class="section-number-3">1.9</span> GC 垃圾收集器</h3>
<div class="outline-text-3" id="text-1-9">
<ol class="org-ol">
<li>年轻代常见垃圾收集器
<ol class="org-ol">
<li>Serial New 收集器是针对新生代的收集器，
<ul class="org-ul">
<li>采用的是复制算法</li>
<li>每次收集使用单线程来做 GC 操作</li>
</ul></li>
<li>Parallel New 收集器，是  SN 收集器的多线程版本
<ul class="org-ul">
<li>使用复制算法</li>
<li>每次收集使用多线程并行来做 GC 操作</li>
</ul></li>
<li>Parallel Scavenge 收集器，针对新生代，采用复制收集算法
<ul class="org-ul">
<li>提供了参数 <code>-XX:+UseAdaptiveSizePolicy</code>, 打开参数后，就不需要手工指定
新生代的大小（-Xmn）, Eden 和 Survivor 区的比例 <code>-XX:SurvivorRatio</code>,
晋升老年代对象年龄 <code>-XX:PretenureSizeThreshold</code> 等细节参数</li>
<li>吞吐量高 虚拟机会根据当前系统的运行情况收集性能监控信息，动态调整这些
参数以提供最合适的停顿时间或者最大的吞吐量</li>
</ul></li>
</ol></li>
<li>老年代常见垃圾收集器
<ol class="org-ol">
<li>Serial Old 收集器，老年代采用标记清理，一般配合年轻代 SN 收集器使用</li>
<li>CMS 收集器，基于标记清理，目的是 <code>减少单次 GC的响应时间</code>, 一般配合年轻
代 PN 收集器一起使用
<ol class="org-ol">
<li>初次标记（触发 STW），仅标记 GC Roots 直接引用对象，耗时短</li>
<li>并发标记（不 STW），多线程标记待回收的对象，耗时长</li>
<li>重新标记（触发 STW, 修正初次标记），并发标记因为没有 STW, 可能产生错
误标记，这里修正这些错误</li>
<li>并发清理</li>
</ol></li>
<li>Parallel Old 收集器，针对老年代，标记整理，一般配合年轻代 PS 收集使用</li>
</ol></li>
<li>G1 收集器(JDK): 整体上是基于标记清理，局部采用复制
<ol class="org-ol">
<li>标记成 Region 的网格区域</li>
<li>E, S, O 分片存在不同 Region</li>
</ol></li>
<li>综上: 新生代基本采用复制算法，老年代采用标记整理算法。CMS 采用标记清理</li>
</ol>
</div>
</div>
