java/java-jvm.org
** 内存泄漏的几种情形
   1. *静态集合类*: 如 HashMap、LinkedList 等等
      - 如果这些容器为静态的，那么它们的生命周期与程序一致，则容器中的对象在程序
        结束之前将不能被释放
      - 长生命周期的对象持有短生命周期对象的引用，尽管短生命周期的
      - 对象不再使用，但是因为长生命周期对象持有它的引用而导致不能被回收
   2. *各种连接不释放*: 如数据库连接、网络连接和 IO 连接等
      - 在对数据库进行操作的过程中，首先需要建立与数据库的连接，当不再使用时，需
        要调用 ~close()~ 方法来释放与数据库的 连接。只有连接被关闭后，垃圾回收器
        才会回收对应的对象
      - 如果在访问数据库的过程中，对 Connection、Statement 或 ResultSet 不显性地
        关闭，将会造成大量的对象无法被回收，从而引起内存泄漏。
   3. *变量不合理的作用域*:
      - 变量的定义的作用范围大于其使用范围，很有可能会造成内存泄漏
      - 如果没有及时地把对象设置为 null，很有可能导致内存泄漏的发生
   4. *内部类持有外部类*:
      - 如果一个外部类的实例对象的方法返回了一个内部类的实例对象，这个内部类对象
        被长期引用了，即使那个外部类实例对象不再被使用，但由于内部类持有外部类的
        实例对象，这个外部类对象将不会被垃圾回收，这也会造成内存泄露
   5. *改变哈希值*:
      - 当一个对象被存储进 HashSet 集合中以后，就不能修改这个对象中的那些参与计算
        哈希值的字段了，
      - 否则，对象修改后的哈希值与最初存储进 HashSet 集合中时的哈希值就不同了，在
        这种情况下，即使在 contains 方法使用该对象的当前引用作为的参数去 HashSet 集
        合中检索对象，也将返回找不到对象的结果，这也会导致无法从 HashSet 集合中单
        独删除当前对象，造成内存泄露
   6. *缓存泄漏*:
      - 内存泄漏的另一个常见来源是缓存，一旦你把对象引用放入到缓存中，他就很容易
        遗忘
      - 对于这个问题，可以使用 WeakHashMap 代表缓存，此种 Map 的特点是，当除了自
        身有对 key 的引用外，此 key 没有其他引用那么此 map 会自动丢弃此值
   7. *监听器和回调*:
      - 内存泄漏第三个常见来源是监听器和其他回调
      - 如果客户端在你实现的 API 中注册回调，却没有显示的取消，那么就会积聚
      - 需要确保回调立即被当作垃圾回收的最佳方法是只保存他的若引用，例如将他们保
        存成为 WeakHashMap 中的键

** Java 类加载机制
   1. 概念:
      - 虚拟机把描述类的数据文件（字节码）加载到内存，并对数据进行验证、准备、解
        析以及类初始化，最终形成可以被虚拟机直接使用的 ~java.lang.Class~ Java 类
        型对象
   2. 类的生命周期:
      - *加载*: 通过一个类的全限定名来获取定义此类的二进制字节流，将这个字节流所
        代表的静态存储结构转化为方法区的运行时数据结构。在内存中(方法区)生成一个
        代表这个类的 ~java.lang.Class~ 对象，作为方法区这个类的各种数据的访问入口
      - *验证*: 为了确保 ~Class~ 文件的字节流中包含的信息符合当前虚拟机的要求，
        文件格式验证、元数据验证、字节码验证、符号引用验证
      - *准备*: 正式为类属性分配内存，设置类属性初始值，这些内存都将在方法区中进
        行分配
      - *解析*: 虚拟机将常量池内的符号引用替换为直接引用
      - *初始化*: 类初始化阶段是类加载过程最后一步。初始化阶段就是执行类构造器
        ~<clinit>()~ 方法的过程
      - *使用*:
      - *卸载*:
   3. Java 类加载器:
      - 类加载器负责加载所有的类，同一个类(一个类用其全限定类名(包名加类名)标志)
        只会被加载一次
      - ~Bootstrap ClassLoader~ : 根类加载器，负责加载 Java 的核心类，它不是
        ~java.lang.ClassLoader~ 的子类，而是由 JVM 自身实现, 主要负责加载
        ~jre/lib~ 目录中或被 =-Xbootclasspath= 指定的路径中的并且文件名是被虚拟
        机识别的文件
      - ~Extension ClassLoader~: 扩展类加载器，扩展类加载器的加载路径是 JDK 目录
        下 ~jre/lib/ext~, 扩展类的 ~getParent()~ 方法返回 null,实际上扩展类加载
        器的父类加载器是根加载器，只是根加载器并不是 Java 实现的
      - ~System ClassLoader~: 系统(应用)类加载器，它负责在 JVM 启动时加载来自
        Java 命令的 ~-classpath~ 选项, ~java.class.path~ 系统属性或 ~CLASSPATH~
        环境变量所指定的 jar 包和类路径。程序可以通过 ~getSystemClassLoader()~
        来获取系统类加载器。系统加载器的加载路径是程序运行的当前路径
        #+BEGIN_SRC java
          ClassLoader loader = ClassLoader.getSystemClassLoader();
          System.out.println(loader); // => sun.misc.Launcher$AppClassLoader@73d16e93
          System.out.println(loader.getParent()); // => sun.misc.Launcher$ExtClassLoader@15db9742
          System.out.println(loader.getParent().getParent()); // => null
        #+END_SRC
   4. 双亲委派模型的工作过程:
      - 首先会先查找当前 ~ClassLoader~ 是否加载过此类，有就返回
      - 如果没有，查询父 ~ClassLoader~ 是否已经加载过此类，如果已经加载过，就直
        接返回 Parent 加载的类
      - 如果整个类加载器体系上的 ~ClassLoader~ 都没有加载过，才由当前 ~ClassLoader~
        加载(调用 ~findClass~)，整个过程类似循环链表一样。
   5. 双亲委托机制的作用:
      - 共享功能: 可以避免重复加载，当父亲已经加载了该类的时候，子类不需要再次加
        载，一些 Framework 层级的类一旦被顶层的 ~ClassLoader~ 加载过就缓存在内存
        里面，以后任何地方用到都不需要重新加载。
      - 隔离功能: 因为 String 已经在启动时被加载，所以用户自定义类是无法加载一个
        自定义的类装载器，保证 Java/Android 核心类库的纯净和安全，防止恶意加载。
   6. 如何打破双亲委派模型？
      - 双亲委派模型的逻辑都在 ~loadClass()~ 中，重写 ~loaderClass()~, 在实际工
        程中一般是通过重写 ~findClass()~ 实现类加载
      - 系统自带的三个类加载器都加载特定目录下的类，如果我们自己的类加载器放在一
        个特殊的目录，那么系统的加载器就无法加载，也就是最终还是由我们自己的加载
        器加载
   7. 自定义 ~ClassLoader~:
      - ~loadClass(String name, boolean resolve)~: 根据指定的二进制名称加载类
      - ~findClass(String name)~: 根据二进制名称来查找类
      - 直接使用或继承已有的 ~ClassLoader~ 实现: ~java.net.URLClassLoader~,
        ~java.security.SecureClassLoader~, ~java.rmi.server.RMIClassLoader~
      - 在调用 ~loadClass()~, 会先根据委派模型在父加载器中加载，如果加载失败，则
        会调用自己的 ~findClass~ 方法来完成加载

** 引起类加载操作的五个行为
   1. 遇到 ~new~, ~getstatic~, ~putstatic~ 或 ~invokestatic~ 这四条字节码指令
   2. 反射调用的时候，如果类没有进行过初始化，则需要先触发其初始化
   3. 子类初始化的时候，如果其父类还没初始化，则需先触发其父类的初始化
   4. 虚拟机执行主类的时候(有 ~main(string[] args)~ )
   5. JDK1.7 动态语言支持

** Java 对象创建时机
   1. 使用 ~new~ 关键字创建对象
   2. 使用 ~Class~ 类的 ~newInstance~ 方法(反射机制)
   3. 使用 ~Constructor~ 类的 ~newInstance~ 方法(反射机制)
   4. 使用 ~Clone~ 方法创建对象
   5. 使用(反)序列化机制创建对象

* 实践案例
** JVM 调优参数
   设置堆空间，栈空间和元数据空间大小
   #+BEGIN_SRC shell
     java -Xms3072M -Xmx3072M -Xss1M -XX:MetaspaceSize=512M -XX:MaxMetaspaceSize=512M -jar app.jar
   #+END_SRC

** JDK 调试工具
*** jps
    打印 JVM 进程号
    #+BEGIN_SRC text
      $ jps
       7 jar
       2078 Jps
    #+END_SRC

