java/java-jvm.html

<div id="outline-container-org368c9fb" class="outline-3">
<h3 id="org368c9fb"><span class="section-number-3">1.10</span> 内存泄漏的几种情形</h3>
<div class="outline-text-3" id="text-1-10">
<ol class="org-ol">
<li><b>静态集合类</b>: 如 HashMap、LinkedList 等等
<ul class="org-ul">
<li>如果这些容器为静态的，那么它们的生命周期与程序一致，则容器中的对象在程序
结束之前将不能被释放</li>
<li>长生命周期的对象持有短生命周期对象的引用，尽管短生命周期的</li>
<li>对象不再使用，但是因为长生命周期对象持有它的引用而导致不能被回收</li>
</ul></li>
<li><b>各种连接不释放</b>: 如数据库连接、网络连接和 IO 连接等
<ul class="org-ul">
<li>在对数据库进行操作的过程中，首先需要建立与数据库的连接，当不再使用时，需
要调用 <code>close()</code> 方法来释放与数据库的 连接。只有连接被关闭后，垃圾回收器
才会回收对应的对象</li>
<li>如果在访问数据库的过程中，对 Connection、Statement 或 ResultSet 不显性地
关闭，将会造成大量的对象无法被回收，从而引起内存泄漏。</li>
</ul></li>
<li><b>变量不合理的作用域</b>:
<ul class="org-ul">
<li>变量的定义的作用范围大于其使用范围，很有可能会造成内存泄漏</li>
<li>如果没有及时地把对象设置为 null，很有可能导致内存泄漏的发生</li>
</ul></li>
<li><b>内部类持有外部类</b>:
<ul class="org-ul">
<li>如果一个外部类的实例对象的方法返回了一个内部类的实例对象，这个内部类对象
被长期引用了，即使那个外部类实例对象不再被使用，但由于内部类持有外部类的
实例对象，这个外部类对象将不会被垃圾回收，这也会造成内存泄露</li>
</ul></li>
<li><b>改变哈希值</b>:
<ul class="org-ul">
<li>当一个对象被存储进 HashSet 集合中以后，就不能修改这个对象中的那些参与计算
哈希值的字段了，</li>
<li>否则，对象修改后的哈希值与最初存储进 HashSet 集合中时的哈希值就不同了，在
这种情况下，即使在 contains 方法使用该对象的当前引用作为的参数去 HashSet 集
合中检索对象，也将返回找不到对象的结果，这也会导致无法从 HashSet 集合中单
独删除当前对象，造成内存泄露</li>
</ul></li>
<li><b>缓存泄漏</b>:
<ul class="org-ul">
<li>内存泄漏的另一个常见来源是缓存，一旦你把对象引用放入到缓存中，他就很容易
遗忘</li>
<li>对于这个问题，可以使用 WeakHashMap 代表缓存，此种 Map 的特点是，当除了自
身有对 key 的引用外，此 key 没有其他引用那么此 map 会自动丢弃此值</li>
</ul></li>
<li><b>监听器和回调</b>:
<ul class="org-ul">
<li>内存泄漏第三个常见来源是监听器和其他回调</li>
<li>如果客户端在你实现的 API 中注册回调，却没有显示的取消，那么就会积聚</li>
<li>需要确保回调立即被当作垃圾回收的最佳方法是只保存他的若引用，例如将他们保
存成为 WeakHashMap 中的键</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org0ae0878" class="outline-3">
<h3 id="org0ae0878"><span class="section-number-3">1.11</span> Java 类加载机制</h3>
<div class="outline-text-3" id="text-1-11">
<ol class="org-ol">
<li>概念:
<ul class="org-ul">
<li>虚拟机把描述类的数据文件（字节码）加载到内存，并对数据进行验证、准备、解
析以及类初始化，最终形成可以被虚拟机直接使用的 <code>java.lang.Class</code> Java 类
型对象</li>
</ul></li>
<li>类的生命周期:
<ul class="org-ul">
<li><b>加载</b>: 通过一个类的全限定名来获取定义此类的二进制字节流，将这个字节流所
代表的静态存储结构转化为方法区的运行时数据结构。在内存中(方法区)生成一个
代表这个类的 <code>java.lang.Class</code> 对象，作为方法区这个类的各种数据的访问入口</li>
<li><b>验证</b>: 为了确保 <code>Class</code> 文件的字节流中包含的信息符合当前虚拟机的要求，
文件格式验证、元数据验证、字节码验证、符号引用验证</li>
<li><b>准备</b>: 正式为类属性分配内存，设置类属性初始值，这些内存都将在方法区中进
行分配</li>
<li><b>解析</b>: 虚拟机将常量池内的符号引用替换为直接引用</li>
<li><b>初始化</b>: 类初始化阶段是类加载过程最后一步。初始化阶段就是执行类构造器
<code>&lt;clinit&gt;()</code> 方法的过程</li>
<li><b>使用</b>:</li>
<li><b>卸载</b>:</li>
</ul></li>
<li>Java 类加载器:
<ul class="org-ul">
<li>类加载器负责加载所有的类，同一个类(一个类用其全限定类名(包名加类名)标志)
只会被加载一次</li>
<li><code>Bootstrap ClassLoader</code> : 根类加载器，负责加载 Java 的核心类，它不是
<code>java.lang.ClassLoader</code> 的子类，而是由 JVM 自身实现, 主要负责加载
<code>jre/lib</code> 目录中或被 <code>-Xbootclasspath</code> 指定的路径中的并且文件名是被虚拟
机识别的文件</li>
<li><code>Extension ClassLoader</code>: 扩展类加载器，扩展类加载器的加载路径是 JDK 目录
下 <code>jre/lib/ext</code>, 扩展类的 <code>getParent()</code> 方法返回 null,实际上扩展类加载
器的父类加载器是根加载器，只是根加载器并不是 Java 实现的</li>
<li><p>
<code>System ClassLoader</code>: 系统(应用)类加载器，它负责在 JVM 启动时加载来自
Java 命令的 <code>-classpath</code> 选项, <code>java.class.path</code> 系统属性或 <code>CLASSPATH</code>
环境变量所指定的 jar 包和类路径。程序可以通过 <code>getSystemClassLoader()</code>
来获取系统类加载器。系统加载器的加载路径是程序运行的当前路径
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #7aa6da;">ClassLoader</span> <span style="color: #e7c547;">loader</span> = ClassLoader.getSystemClassLoader<span style="color: #8d5649;">()</span>;
System.out.println<span style="color: #8d5649;">(</span>loader<span style="color: #8d5649;">)</span>; <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">=&gt; sun.misc.Launcher$AppClassLoader@73d16e93</span>
System.out.println<span style="color: #8d5649;">(</span>loader.getParent<span style="color: #d8241f;">()</span><span style="color: #8d5649;">)</span>; <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">=&gt; sun.misc.Launcher$ExtClassLoader@15db9742</span>
System.out.println<span style="color: #8d5649;">(</span>loader.getParent<span style="color: #d8241f;">()</span>.getParent<span style="color: #d8241f;">()</span><span style="color: #8d5649;">)</span>; <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">=&gt; null</span>
</pre>
</div></li>
</ul></li>
<li>双亲委派模型的工作过程:
<ul class="org-ul">
<li>首先会先查找当前 <code>ClassLoader</code> 是否加载过此类，有就返回</li>
<li>如果没有，查询父 <code>ClassLoader</code> 是否已经加载过此类，如果已经加载过，就直
接返回 Parent 加载的类</li>
<li>如果整个类加载器体系上的 <code>ClassLoader</code> 都没有加载过，才由当前 <code>ClassLoader</code>
加载(调用 <code>findClass</code>)，整个过程类似循环链表一样。</li>
</ul></li>
<li>双亲委托机制的作用:
<ul class="org-ul">
<li>共享功能: 可以避免重复加载，当父亲已经加载了该类的时候，子类不需要再次加
载，一些 Framework 层级的类一旦被顶层的 <code>ClassLoader</code> 加载过就缓存在内存
里面，以后任何地方用到都不需要重新加载。</li>
<li>隔离功能: 因为 String 已经在启动时被加载，所以用户自定义类是无法加载一个
自定义的类装载器，保证 Java/Android 核心类库的纯净和安全，防止恶意加载。</li>
</ul></li>
<li>如何打破双亲委派模型？
<ul class="org-ul">
<li>双亲委派模型的逻辑都在 <code>loadClass()</code> 中，重写 <code>loaderClass()</code>, 在实际工
程中一般是通过重写 <code>findClass()</code> 实现类加载</li>
<li>系统自带的三个类加载器都加载特定目录下的类，如果我们自己的类加载器放在一
个特殊的目录，那么系统的加载器就无法加载，也就是最终还是由我们自己的加载
器加载</li>
</ul></li>
<li>自定义 <code>ClassLoader</code>:
<ul class="org-ul">
<li><code>loadClass(String name, boolean resolve)</code>: 根据指定的二进制名称加载类</li>
<li><code>findClass(String name)</code>: 根据二进制名称来查找类</li>
<li>直接使用或继承已有的 <code>ClassLoader</code> 实现: <code>java.net.URLClassLoader</code>,
<code>java.security.SecureClassLoader</code>, <code>java.rmi.server.RMIClassLoader</code></li>
<li>在调用 <code>loadClass()</code>, 会先根据委派模型在父加载器中加载，如果加载失败，则
会调用自己的 <code>findClass</code> 方法来完成加载</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org4f7b260" class="outline-3">
<h3 id="org4f7b260"><span class="section-number-3">1.12</span> 引起类加载操作的五个行为</h3>
<div class="outline-text-3" id="text-1-12">
<ol class="org-ol">
<li>遇到 <code>new</code>, <code>getstatic</code>, <code>putstatic</code> 或 <code>invokestatic</code> 这四条字节码指令</li>
<li>反射调用的时候，如果类没有进行过初始化，则需要先触发其初始化</li>
<li>子类初始化的时候，如果其父类还没初始化，则需先触发其父类的初始化</li>
<li>虚拟机执行主类的时候(有 <code>main(string[] args)</code> )</li>
<li>JDK1.7 动态语言支持</li>
</ol>
</div>
</div>

<div id="outline-container-org7132ce7" class="outline-3">
<h3 id="org7132ce7"><span class="section-number-3">1.13</span> Java 对象创建时机</h3>
<div class="outline-text-3" id="text-1-13">
<ol class="org-ol">
<li>使用 <code>new</code> 关键字创建对象</li>
<li>使用 <code>Class</code> 类的 <code>newInstance</code> 方法(反射机制)</li>
<li>使用 <code>Constructor</code> 类的 <code>newInstance</code> 方法(反射机制)</li>
<li>使用 <code>Clone</code> 方法创建对象</li>
<li>使用(反)序列化机制创建对象</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org09fa631" class="outline-2">
<h2 id="org09fa631"><span class="section-number-2">2</span> 实践案例</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgabdadaf" class="outline-3">
<h3 id="orgabdadaf"><span class="section-number-3">2.1</span> JVM 调优参数</h3>
<div class="outline-text-3" id="text-2-1">
<p>
设置堆空间，栈空间和元数据空间大小
</p>
<div class="org-src-container">
<pre class="src src-sh">java -Xms3072M -Xmx3072M -Xss1M -XX:<span style="color: #e7c547;">MetaspaceSize</span>=512M -XX:<span style="color: #e7c547;">MaxMetaspaceSize</span>=512M -jar app.jar
</pre>
</div>
</div>
</div>
