java/java-jvm.org
*** jstat
    通过 ~jstat~ 动态查看堆内存使用情况
    #+BEGIN_SRC shell
      # 查看堆内存使用情况
      jstat -gcutil <pid> 1000

      # 查看老年代使用情况
      jstat -gcold <pid> 1000

      # 查看年轻代使用情况
      jstat -gcnew <pid> 1000
    #+END_SRC

    使用示例，每一秒刷新一次
    #+BEGIN_SRC text
      # 查看堆内存使用情况
      $ jstat -gcutil 70670 1000
        S0     S1     E      O      M     CCS    YGC     YGCT    FGC    FGCT     GCT
        0.00   0.00   6.00   7.90  93.92  84.70      2    0.009     2    0.150    0.159
        0.00   0.00   6.00   7.90  93.92  84.70      2    0.009     2    0.150    0.159
        0.00   0.00   6.00   7.90  93.92  84.70      2    0.009     2    0.150    0.159
        0.00   0.00   6.00   7.90  93.92  84.70      2    0.009     2    0.150    0.159
        0.00   0.00   6.00   7.90  93.92  84.70      2    0.009     2    0.150    0.159

      # 查看老年代使用情况
      $ jstat -gcold 70670 1000
           MC       MU      CCSC     CCSU       OC          OU       YGC    FGC    FGCT     GCT
       21888.0  20556.1   2432.0   2059.9     79872.0      6313.3      2     2    0.150    0.159
       21888.0  20556.1   2432.0   2059.9     79872.0      6313.3      2     2    0.150    0.159
       21888.0  20556.1   2432.0   2059.9     79872.0      6313.3      2     2    0.150    0.159
       21888.0  20556.1   2432.0   2059.9     79872.0      6313.3      2     2    0.150    0.159
       21888.0  20556.1   2432.0   2059.9     79872.0      6313.3      2     2    0.150    0.159

      # 查看年轻代使用情况
      $ jstat -gcnew 70670 1000
       S0C    S1C    S0U    S1U   TT MTT  DSS      EC       EU     YGC     YGCT
       0.0    0.0    0.0    0.0  1  15 1024.0  51200.0   3072.0      2    0.009
       0.0    0.0    0.0    0.0  1  15 1024.0  51200.0   3072.0      2    0.009
       0.0    0.0    0.0    0.0  1  15 1024.0  51200.0   3072.0      2    0.009
       0.0    0.0    0.0    0.0  1  15 1024.0  51200.0   3072.0      2    0.009
       0.0    0.0    0.0    0.0  1  15 1024.0  51200.0   3072.0      2    0.009
    #+END_SRC

*** jmap
    使用 ~jmap~ 查看 JVM 虚拟机内存
    #+BEGIN_SRC shell
      # 查看所有内存分布
      jmap <pid>

      # 打印堆内存信息
      jmap -heap <pid>

      # 显示堆中对象的统计信息
      jmap -histo:live <pid>

      # 打印类加载器信息
      jmap -clstats <pid>

      # 打印等待终结的对象信息
      jmap -finalizerinfo <pid>

      # 生成堆转储快照 dump 文件
      jmap -dump:format=b,file=heapdump.hprof <pid>
      # live 子选项表示只 dump 存活的对象
      jmap -dump:live,format=b,file=heapdump.hprof <pid>

      jmap -dump:live,format=b,file=heapdump-live-$(date +'%Y%m%d-%H%M%S').hprof <pid>
      jmap -dump:format=b,file=heapdump-all-$(date +'%Y%m%d-%H%M%S').hprof <pid>
    #+END_SRC

    #+BEGIN_SRC text
      $ jmap 19112
      Attaching to process ID 19112, please wait...
      Debugger attached successfully.
      Server compiler detected.
      JVM version is 25.191-b12
      0x0000000069790000      144K    C:\Local\Java\jdk1.8.0_191\jre\bin\sunec.dll
      0x0000000069800000      52K     C:\Local\Java\jdk1.8.0_191\jre\bin\management.dll
      0x0000000069810000      140K    C:\Local\Java\jdk1.8.0_191\jre\bin\instrument.dll
      0x0000000069840000      68K     C:\Local\Java\jdk1.8.0_191\jre\bin\nio.dll
      0x0000000069860000      104K    C:\Local\Java\jdk1.8.0_191\jre\bin\net.dll
      0x0000000069880000      88K     C:\Local\Java\jdk1.8.0_191\jre\bin\zip.dll
      0x00000000698a0000      164K    C:\Local\Java\jdk1.8.0_191\jre\bin\java.dll
      0x00000000698d0000      60K     C:\Local\Java\jdk1.8.0_191\jre\bin\verify.dll
      0x00000000698e0000      8848K   C:\Local\Java\jdk1.8.0_191\jre\bin\server\jvm.dll
      0x000000006a190000      840K    C:\Local\Java\jdk1.8.0_191\jre\bin\msvcr100.dll
      0x00007ff78f6f0000      220K    C:\Local\Java\jdk1.8.0_191\bin\java.exe
      ... 省略
      0x00007ffaebe60000      72K     C:\WINDOWS\System32\winrnr.dll
      0x00007ffaebe80000      84K     C:\WINDOWS\system32\wshbth.dll
      0x00007ffaebfa0000      108K    C:\WINDOWS\system32\pnrpnsp.dll
      0x00007ffb16e60000      756K    C:\WINDOWS\System32\KERNEL32.DLL
      0x00007ffb16f20000      1196K   C:\WINDOWS\System32\RPCRT4.dll
      0x00007ffb17680000      1664K   C:\WINDOWS\System32\USER32.dll
      0x00007ffb17820000      696K    C:\WINDOWS\System32\SHCORE.dll
      0x00007ffb178d0000      632K    C:\WINDOWS\System32\msvcrt.dll
      0x00007ffb17970000      168K    C:\WINDOWS\System32\GDI32.dll
      0x00007ffb17a30000      192K    C:\WINDOWS\System32\IMM32.DLL
      0x00007ffb17ac0000      428K    C:\WINDOWS\System32\WS2_32.dll
      0x00007ffb17b30000      7420K   C:\WINDOWS\System32\SHELL32.dll
      0x00007ffb18310000      2004K   C:\WINDOWS\SYSTEM32\ntdll.dll

      $ jmap -heap 19112
      Attaching to process ID 19112, please wait...
      Debugger attached successfully.
      Server compiler detected.
      JVM version is 25.191-b12

      using thread-local object allocation.
      Parallel GC with 8 thread(s)

      Heap Configuration:
         MinHeapFreeRatio         = 0
         MaxHeapFreeRatio         = 100
         MaxHeapSize              = 4276092928 (4078.0MB)
         NewSize                  = 89128960 (85.0MB)
         MaxNewSize               = 1425014784 (1359.0MB)
         OldSize                  = 179306496 (171.0MB)
         NewRatio                 = 2
         SurvivorRatio            = 8
         MetaspaceSize            = 21807104 (20.796875MB)
         CompressedClassSpaceSize = 1073741824 (1024.0MB)
         MaxMetaspaceSize         = 17592186044415 MB
         G1HeapRegionSize         = 0 (0.0MB)

      Heap Usage:
      PS Young Generation
      Eden Space:
         capacity = 538968064 (514.0MB)
         used     = 39151888 (37.33815002441406MB)
         free     = 499816176 (476.66184997558594MB)
         7.2642315222595455% used
      From Space:
         capacity = 24117248 (23.0MB)
         used     = 24101024 (22.984527587890625MB)
         free     = 16224 (0.015472412109375MB)
         99.93272864300272% used
      To Space:
         capacity = 35651584 (34.0MB)
         used     = 0 (0.0MB)
         free     = 35651584 (34.0MB)
         0.0% used
      PS Old Generation
         capacity = 213385216 (203.5MB)
         used     = 68250752 (65.0889892578125MB)
         free     = 145134464 (138.4110107421875MB)
         31.98476130605037% used

      38914 interned Strings occupying 4036696 bytes.

    #+END_SRC

