java/java-jvm.html

<div id="outline-container-orgb4b89b6" class="outline-3">
<h3 id="orgb4b89b6"><span class="section-number-3">2.2</span> JDK 调试工具</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgefd2af5" class="outline-4">
<h4 id="orgefd2af5"><span class="section-number-4">2.2.1</span> jps</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
打印 JVM 进程号
</p>
<div class="org-src-container">
<pre class="src src-text">$ jps
 7 jar
 2078 Jps
</pre>
</div>
</div>
</div>

<div id="outline-container-org1c8897e" class="outline-4">
<h4 id="org1c8897e"><span class="section-number-4">2.2.2</span> jstat</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
通过 <code>jstat</code> 动态查看堆内存使用情况
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">&#26597;&#30475;&#22534;&#20869;&#23384;&#20351;&#29992;&#24773;&#20917;</span>
jstat -gcutil &lt;pid&gt; 1000

<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">&#26597;&#30475;&#32769;&#24180;&#20195;&#20351;&#29992;&#24773;&#20917;</span>
jstat -gcold &lt;pid&gt; 1000

<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">&#26597;&#30475;&#24180;&#36731;&#20195;&#20351;&#29992;&#24773;&#20917;</span>
jstat -gcnew &lt;pid&gt; 1000
</pre>
</div>

<p>
使用示例，每一秒刷新一次
</p>
<div class="org-src-container">
<pre class="src src-text"># &#26597;&#30475;&#22534;&#20869;&#23384;&#20351;&#29992;&#24773;&#20917;
$ jstat -gcutil 70670 1000
  S0     S1     E      O      M     CCS    YGC     YGCT    FGC    FGCT     GCT
  0.00   0.00   6.00   7.90  93.92  84.70      2    0.009     2    0.150    0.159
  0.00   0.00   6.00   7.90  93.92  84.70      2    0.009     2    0.150    0.159
  0.00   0.00   6.00   7.90  93.92  84.70      2    0.009     2    0.150    0.159
  0.00   0.00   6.00   7.90  93.92  84.70      2    0.009     2    0.150    0.159
  0.00   0.00   6.00   7.90  93.92  84.70      2    0.009     2    0.150    0.159

# &#26597;&#30475;&#32769;&#24180;&#20195;&#20351;&#29992;&#24773;&#20917;
$ jstat -gcold 70670 1000
     MC       MU      CCSC     CCSU       OC          OU       YGC    FGC    FGCT     GCT
 21888.0  20556.1   2432.0   2059.9     79872.0      6313.3      2     2    0.150    0.159
 21888.0  20556.1   2432.0   2059.9     79872.0      6313.3      2     2    0.150    0.159
 21888.0  20556.1   2432.0   2059.9     79872.0      6313.3      2     2    0.150    0.159
 21888.0  20556.1   2432.0   2059.9     79872.0      6313.3      2     2    0.150    0.159
 21888.0  20556.1   2432.0   2059.9     79872.0      6313.3      2     2    0.150    0.159

# &#26597;&#30475;&#24180;&#36731;&#20195;&#20351;&#29992;&#24773;&#20917;
$ jstat -gcnew 70670 1000
 S0C    S1C    S0U    S1U   TT MTT  DSS      EC       EU     YGC     YGCT
 0.0    0.0    0.0    0.0  1  15 1024.0  51200.0   3072.0      2    0.009
 0.0    0.0    0.0    0.0  1  15 1024.0  51200.0   3072.0      2    0.009
 0.0    0.0    0.0    0.0  1  15 1024.0  51200.0   3072.0      2    0.009
 0.0    0.0    0.0    0.0  1  15 1024.0  51200.0   3072.0      2    0.009
 0.0    0.0    0.0    0.0  1  15 1024.0  51200.0   3072.0      2    0.009
</pre>
</div>
</div>
</div>

<div id="outline-container-org37a54fb" class="outline-4">
<h4 id="org37a54fb"><span class="section-number-4">2.2.3</span> jmap</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
使用 <code>jmap</code> 查看 JVM 虚拟机内存
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">&#26597;&#30475;&#25152;&#26377;&#20869;&#23384;&#20998;&#24067;</span>
jmap &lt;pid&gt;

<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">&#25171;&#21360;&#22534;&#20869;&#23384;&#20449;&#24687;</span>
jmap -heap &lt;pid&gt;

<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">&#26174;&#31034;&#22534;&#20013;&#23545;&#35937;&#30340;&#32479;&#35745;&#20449;&#24687;</span>
jmap -histo:live &lt;pid&gt;

<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">&#25171;&#21360;&#31867;&#21152;&#36733;&#22120;&#20449;&#24687;</span>
jmap -clstats &lt;pid&gt;

<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">&#25171;&#21360;&#31561;&#24453;&#32456;&#32467;&#30340;&#23545;&#35937;&#20449;&#24687;</span>
jmap -finalizerinfo &lt;pid&gt;

<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">&#29983;&#25104;&#22534;&#36716;&#20648;&#24555;&#29031; dump &#25991;&#20214;</span>
jmap -dump:<span style="color: #e7c547;">format</span>=b,<span style="color: #e7c547;">file</span>=heapdump.hprof &lt;pid&gt;
<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">live &#23376;&#36873;&#39033;&#34920;&#31034;&#21482; dump &#23384;&#27963;&#30340;&#23545;&#35937;</span>
jmap -dump:live,<span style="color: #e7c547;">format</span>=b,<span style="color: #e7c547;">file</span>=heapdump.hprof &lt;pid&gt;

jmap -dump:live,<span style="color: #e7c547;">format</span>=b,<span style="color: #e7c547;">file</span>=heapdump-live-$(date +<span style="color: #70c0b1;">'%Y%m%d-%H%M%S'</span>).hprof &lt;pid&gt;
jmap -dump:<span style="color: #e7c547;">format</span>=b,<span style="color: #e7c547;">file</span>=heapdump-all-$(date +<span style="color: #70c0b1;">'%Y%m%d-%H%M%S'</span>).hprof &lt;pid&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">$ jmap 19112
Attaching to process ID 19112, please wait...
Debugger attached successfully.
Server compiler detected.
JVM version is 25.191-b12
0x0000000069790000      144K    C:\Local\Java\jdk1.8.0_191\jre\bin\sunec.dll
0x0000000069800000      52K     C:\Local\Java\jdk1.8.0_191\jre\bin\management.dll
0x0000000069810000      140K    C:\Local\Java\jdk1.8.0_191\jre\bin\instrument.dll
0x0000000069840000      68K     C:\Local\Java\jdk1.8.0_191\jre\bin\nio.dll
0x0000000069860000      104K    C:\Local\Java\jdk1.8.0_191\jre\bin\net.dll
0x0000000069880000      88K     C:\Local\Java\jdk1.8.0_191\jre\bin\zip.dll
0x00000000698a0000      164K    C:\Local\Java\jdk1.8.0_191\jre\bin\java.dll
0x00000000698d0000      60K     C:\Local\Java\jdk1.8.0_191\jre\bin\verify.dll
0x00000000698e0000      8848K   C:\Local\Java\jdk1.8.0_191\jre\bin\server\jvm.dll
0x000000006a190000      840K    C:\Local\Java\jdk1.8.0_191\jre\bin\msvcr100.dll
0x00007ff78f6f0000      220K    C:\Local\Java\jdk1.8.0_191\bin\java.exe
... &#30465;&#30053;
0x00007ffaebe60000      72K     C:\WINDOWS\System32\winrnr.dll
0x00007ffaebe80000      84K     C:\WINDOWS\system32\wshbth.dll
0x00007ffaebfa0000      108K    C:\WINDOWS\system32\pnrpnsp.dll
0x00007ffb16e60000      756K    C:\WINDOWS\System32\KERNEL32.DLL
0x00007ffb16f20000      1196K   C:\WINDOWS\System32\RPCRT4.dll
0x00007ffb17680000      1664K   C:\WINDOWS\System32\USER32.dll
0x00007ffb17820000      696K    C:\WINDOWS\System32\SHCORE.dll
0x00007ffb178d0000      632K    C:\WINDOWS\System32\msvcrt.dll
0x00007ffb17970000      168K    C:\WINDOWS\System32\GDI32.dll
0x00007ffb17a30000      192K    C:\WINDOWS\System32\IMM32.DLL
0x00007ffb17ac0000      428K    C:\WINDOWS\System32\WS2_32.dll
0x00007ffb17b30000      7420K   C:\WINDOWS\System32\SHELL32.dll
0x00007ffb18310000      2004K   C:\WINDOWS\SYSTEM32\ntdll.dll

$ jmap -heap 19112
Attaching to process ID 19112, please wait...
Debugger attached successfully.
Server compiler detected.
JVM version is 25.191-b12

using thread-local object allocation.
Parallel GC with 8 thread(s)

Heap Configuration:
   MinHeapFreeRatio         = 0
   MaxHeapFreeRatio         = 100
   MaxHeapSize              = 4276092928 (4078.0MB)
   NewSize                  = 89128960 (85.0MB)
   MaxNewSize               = 1425014784 (1359.0MB)
   OldSize                  = 179306496 (171.0MB)
   NewRatio                 = 2
   SurvivorRatio            = 8
   MetaspaceSize            = 21807104 (20.796875MB)
   CompressedClassSpaceSize = 1073741824 (1024.0MB)
   MaxMetaspaceSize         = 17592186044415 MB
   G1HeapRegionSize         = 0 (0.0MB)

Heap Usage:
PS Young Generation
Eden Space:
   capacity = 538968064 (514.0MB)
   used     = 39151888 (37.33815002441406MB)
   free     = 499816176 (476.66184997558594MB)
   7.2642315222595455% used
From Space:
   capacity = 24117248 (23.0MB)
   used     = 24101024 (22.984527587890625MB)
   free     = 16224 (0.015472412109375MB)
   99.93272864300272% used
To Space:
   capacity = 35651584 (34.0MB)
   used     = 0 (0.0MB)
   free     = 35651584 (34.0MB)
   0.0% used
PS Old Generation
   capacity = 213385216 (203.5MB)
   used     = 68250752 (65.0889892578125MB)
   free     = 145134464 (138.4110107421875MB)
   31.98476130605037% used

38914 interned Strings occupying 4036696 bytes.

</pre>
</div>
</div>
</div>
