java/java-jvm.html

<div id="outline-container-org1f8b27c" class="outline-4">
<h4 id="org1f8b27c"><span class="section-number-4">2.2.4</span> jstack</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
<code>jstack</code> 可以打印线程栈
</p>
<div class="org-src-container">
<pre class="src src-text"># jstack 7
2021-07-05 10:50:34
Full thread dump OpenJDK 64-Bit Server VM (25.212-b04 mixed mode):

"Attach Listener" #2044 daemon prio=9 os_prio=0 tid=0x00007f2820001000 nid=0x99a waiting on condition [0x0000000000000000]
   java.lang.Thread.State: RUNNABLE

"logback-6" #1731 daemon prio=5 os_prio=0 tid=0x00007f27d8090000 nid=0x6df waiting on condition [0x00007f27b1de6000]
   java.lang.Thread.State: WAITING (parking)
        at sun.misc.Unsafe.park(Native Method)
        - parking to wait for  &lt;0x00000007b9cc83c0&gt; (a java.util.concurrent.locks.AbstractQueuedSynchronizer$ConditionObject)
        at java.util.concurrent.locks.LockSupport.park(LockSupport.java:175)
        at java.util.concurrent.locks.AbstractQueuedSynchronizer$ConditionObject.await(AbstractQueuedSynchronizer.java:2039)
        at java.util.concurrent.ScheduledThreadPoolExecutor$DelayedWorkQueue.take(ScheduledThreadPoolExecutor.java:1081)
        at java.util.concurrent.ScheduledThreadPoolExecutor$DelayedWorkQueue.take(ScheduledThreadPoolExecutor.java:809)
        at java.util.concurrent.ThreadPoolExecutor.getTask(ThreadPoolExecutor.java:1074)
        at java.util.concurrent.ThreadPoolExecutor.runWorker(ThreadPoolExecutor.java:1134)
        at java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:624)
        at java.lang.Thread.run(Thread.java:748)

"logback-5" #1730 daemon prio=5 os_prio=0 tid=0x00007f27d8405800 nid=0x6de waiting on condition [0x00007f27b1ee7000]
   java.lang.Thread.State: WAITING (parking)
        at sun.misc.Unsafe.park(Native Method)
        - parking to wait for  &lt;0x00000007b9cc83c0&gt; (a java.util.concurrent.locks.AbstractQueuedSynchronizer$ConditionObject)
        at java.util.concurrent.locks.LockSupport.park(LockSupport.java:175)
        at java.util.concurrent.locks.AbstractQueuedSynchronizer$ConditionObject.await(AbstractQueuedSynchronizer.java:2039)
        at java.util.concurrent.ScheduledThreadPoolExecutor$DelayedWorkQueue.take(ScheduledThreadPoolExecutor.java:1081)
        at java.util.concurrent.ScheduledThreadPoolExecutor$DelayedWorkQueue.take(ScheduledThreadPoolExecutor.java:809)
        at java.util.concurrent.ThreadPoolExecutor.getTask(ThreadPoolExecutor.java:1074)
        at java.util.concurrent.ThreadPoolExecutor.runWorker(ThreadPoolExecutor.java:1134)
        at java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:624)
        at java.lang.Thread.run(Thread.java:748)

... &#30465;&#30053;

"Service Thread" #20 daemon prio=9 os_prio=0 tid=0x00007f28b0431000 nid=0x33 runnable [0x0000000000000000]
   java.lang.Thread.State: RUNNABLE

"C1 CompilerThread14" #19 daemon prio=9 os_prio=0 tid=0x00007f28b042e000 nid=0x32 waiting on condition [0x0000000000000000]
   java.lang.Thread.State: RUNNABLE

"C1 CompilerThread13" #18 daemon prio=9 os_prio=0 tid=0x00007f28b042c000 nid=0x31 waiting on condition [0x0000000000000000]
   java.lang.Thread.State: RUNNABLE

... &#30465;&#30053;

"VM Thread" os_prio=0 tid=0x00007f28b03c6000 nid=0x20 runnable

"GC task thread#0 (ParallelGC)" os_prio=0 tid=0x00007f28b0020000 nid=0x9 runnable

"GC task thread#1 (ParallelGC)" os_prio=0 tid=0x00007f28b0022000 nid=0xa runnable

... &#30465;&#30053;

"VM Periodic Task Thread" os_prio=0 tid=0x00007f28b0433800 nid=0x34 waiting on condition

JNI global references: 2614
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb64fe40" class="outline-4">
<h4 id="orgb64fe40"><span class="section-number-4">2.2.5</span> arthas</h4>
<div class="outline-text-4" id="text-2-2-5">
<p>
阿里巴巴开源的 JVM 监控调试工具 <a href="https://github.com/alibaba/arthas">Arthas</a> 提供更多调试方法
</p>
</div>
</div>

<div id="outline-container-org6d60285" class="outline-4">
<h4 id="org6d60285"><span class="section-number-4">2.2.6</span> Eclipse Memory Analyzer</h4>
<div class="outline-text-4" id="text-2-2-6">
<p>
Eclipse <a href="https://www.eclipse.org/mat/downloads.php">mat</a> 工具提供分析内存镜像的方法，可以自行前往官网下载
</p>
</div>
</div>
</div>

<div id="outline-container-org4266804" class="outline-3">
<h3 id="org4266804"><span class="section-number-3">2.3</span> 逃逸分析</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Java 在发现 new 出来的对象如果只在当前方法中运行，会直接进入线程栈，而不会放入
堆空间，这个现象叫做逃逸分析
</p>

<p>
实验时可以添加下列 Java 启动参数来显示，为达到演示效果需要现在堆空间为 10M
</p>
<div class="org-src-container">
<pre class="src src-sh">-Xmx10m -Xms10m -XX:+PrintGC -XX:-DoEscapeAnalysis
</pre>
</div>

<p>
JDK 1.6 后默认开启逃逸分析 <code>-XX:-DoEscapeAnalysis</code> 选项，为完成实验需要临时关
闭一下逃逸分析选项
</p>

<p>
添加如下实验代码
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #b9ca4a;">public</span> <span style="color: #b9ca4a;">class</span> <span style="color: #7aa6da;">Example02</span> <span style="color: #8d5649;">{</span>
  <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">-Xmx10m -Xms10m -XX:+PrintGC -XX:-DoEscapeAnalysis</span>
  <span style="color: #b9ca4a;">public</span> <span style="color: #b9ca4a;">static</span> <span style="color: #7aa6da;">void</span> <span style="color: #e78c45;">main</span><span style="color: #d8241f;">(</span><span style="color: #7aa6da;">String</span><span style="color: #9564bf;">[]</span> <span style="color: #e7c547;">args</span><span style="color: #d8241f;">)</span> <span style="color: #d8241f;">{</span>
    <span style="color: #b9ca4a;">while</span> <span style="color: #9564bf;">(</span><span style="color: #7aa6da;">true</span><span style="color: #9564bf;">)</span> <span style="color: #9564bf;">{</span>
      <span style="color: #7aa6da;">Integer</span> <span style="color: #e7c547;">temp</span> = <span style="color: #b9ca4a;">new</span> <span style="color: #7aa6da;">Integer</span><span style="color: #24a222;">(</span>999999999<span style="color: #24a222;">)</span>;
    <span style="color: #9564bf;">}</span>
  <span style="color: #d8241f;">}</span>
<span style="color: #8d5649;">}</span>
</pre>
</div>

<p>
添加 <code>-XX:-DoEscapeAnalysis</code> 选项关闭逃逸分析后
</p>
<div class="org-src-container">
<pre class="src src-text">[GC (Allocation Failure)  2048K-&gt;488K(9728K), 0.0015437 secs]
[GC (Allocation Failure)  2536K-&gt;504K(9728K), 0.0013609 secs]
[GC (Allocation Failure)  2552K-&gt;504K(9728K), 0.0004373 secs]
[GC (Allocation Failure)  2552K-&gt;488K(9728K), 0.0004283 secs]
[GC (Allocation Failure)  2536K-&gt;488K(9728K), 0.0004708 secs]
[GC (Allocation Failure)  2536K-&gt;488K(9728K), 0.0004193 secs]
[GC (Allocation Failure)  2536K-&gt;433K(9728K), 0.0004879 secs]
[GC (Allocation Failure)  2481K-&gt;433K(8704K), 0.0002465 secs]
[GC (Allocation Failure)  1457K-&gt;433K(9216K), 0.0002974 secs]
[GC (Allocation Failure)  1457K-&gt;433K(9216K), 0.0002519 secs]
[GC (Allocation Failure)  1457K-&gt;433K(9216K), 0.0002466 secs]
[GC (Allocation Failure)  1457K-&gt;433K(9216K), 0.0002524 secs]
... &#30127;&#29378;&#22320; GC
</pre>
</div>
</div>
</div>
