java/java-jvm.html

<div id="outline-container-orgf60fbb0" class="outline-3">
<h3 id="orgf60fbb0"><span class="section-number-3">2.4</span> JDBC 知识点</h3>
<div class="outline-text-3" id="text-2-4">
<ol class="org-ol">
<li>SPI (Service Provider Interface) 实际上是基于接口的编程, 策略模式和配置文
件组合实现的动态加载机制
<ul class="org-ul">
<li>三方驱动在 <code>META-INF/services/java.sql.Driver</code> 中添加驱动配置信息</li>
<li><p>
<code>DriverManager</code> 的静态代码块中通过调用 <code>loadInitialDrivers();</code> 来读取使
用驱动信息
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #c397d8;">/**</span>
<span style="color: #c397d8;"> * Load the initial JDBC drivers by checking the System property</span>
<span style="color: #c397d8;"> * jdbc.properties and then use the </span><span style="color: #7aa6da;">{@code ServiceLoader}</span><span style="color: #c397d8;"> mechanism</span>
<span style="color: #c397d8;"> */</span>
<span style="color: #b9ca4a;">static</span> <span style="color: #8d5649;">{</span>
    loadInitialDrivers<span style="color: #d8241f;">()</span>;
    println<span style="color: #d8241f;">(</span><span style="color: #70c0b1;">"JDBC DriverManager initialized"</span><span style="color: #d8241f;">)</span>;
<span style="color: #8d5649;">}</span>
</pre>
</div></li>
<li><p>
在 <code>loadInitialDrivers();</code> 方法中， <code>ServiceLoader.load(Driver.class)</code>
通过扫描 <code>META-INF/services</code> 目录下的配置文件找到实现类的全限定名，把类
加载到 JVM
</p>
<div class="org-src-container">
<pre class="src src-java">AccessController.doPrivileged<span style="color: #8d5649;">(</span><span style="color: #b9ca4a;">new</span> <span style="color: #7aa6da;">PrivilegedAction</span><span style="color: #d8241f;">&lt;</span><span style="color: #7aa6da;">Void</span><span style="color: #d8241f;">&gt;()</span> <span style="color: #d8241f;">{</span>
    <span style="color: #b9ca4a;">public</span> <span style="color: #7aa6da;">Void</span> <span style="color: #e78c45;">run</span><span style="color: #9564bf;">()</span> <span style="color: #9564bf;">{</span>

        <span style="color: #7aa6da;">ServiceLoader</span><span style="color: #24a222;">&lt;</span><span style="color: #7aa6da;">Driver</span><span style="color: #24a222;">&gt;</span> <span style="color: #e7c547;">loadedDrivers</span> = ServiceLoader.load<span style="color: #24a222;">(</span>Driver.<span style="color: #b9ca4a;">class</span><span style="color: #24a222;">)</span>;
        <span style="color: #7aa6da;">Iterator</span><span style="color: #24a222;">&lt;</span><span style="color: #7aa6da;">Driver</span><span style="color: #24a222;">&gt;</span> <span style="color: #e7c547;">driversIterator</span> = loadedDrivers.iterator<span style="color: #24a222;">()</span>;

        <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">Load these drivers, so that they can be instantiated.</span>
<span style="color: #969896; font-style: italic;">         * It may be the case that the driver class may not be there</span>
<span style="color: #969896; font-style: italic;">         * i.e. there may be a packaged driver with the service class</span>
<span style="color: #969896; font-style: italic;">         * as implementation of java.sql.Driver but the actual class</span>
<span style="color: #969896; font-style: italic;">         * may be missing. In that case a java.util.ServiceConfigurationError</span>
<span style="color: #969896; font-style: italic;">         * will be thrown at runtime by the VM trying to locate</span>
<span style="color: #969896; font-style: italic;">         * and load the service.</span>
<span style="color: #969896; font-style: italic;">         *</span>
<span style="color: #969896; font-style: italic;">         * Adding a try catch block to catch those runtime errors</span>
<span style="color: #969896; font-style: italic;">         * if driver not available in classpath but it's</span>
<span style="color: #969896; font-style: italic;">         * packaged as service and that service is there in classpath.</span>
<span style="color: #969896; font-style: italic;">         */</span>
        <span style="color: #b9ca4a;">try</span><span style="color: #24a222;">{</span>
            <span style="color: #b9ca4a;">while</span><span style="color: #ff7f00;">(</span>driversIterator.hasNext<span style="color: #1776b6;">()</span><span style="color: #ff7f00;">)</span> <span style="color: #ff7f00;">{</span>
                driversIterator.next<span style="color: #1776b6;">()</span>;
            <span style="color: #ff7f00;">}</span>
        <span style="color: #24a222;">}</span> <span style="color: #b9ca4a;">catch</span><span style="color: #24a222;">(</span><span style="color: #7aa6da;">Throwable</span> <span style="color: #e7c547;">t</span><span style="color: #24a222;">)</span> <span style="color: #24a222;">{</span>
        <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">Do nothing</span>
        <span style="color: #24a222;">}</span>
        <span style="color: #b9ca4a;">return</span> <span style="color: #7aa6da;">null</span>;
    <span style="color: #9564bf;">}</span>
<span style="color: #d8241f;">}</span><span style="color: #8d5649;">)</span>;
</pre>
</div></li>
</ul></li>
<li><p>
使用 <code>DriverManager</code> 中定义了 <code>registeredDrivers</code> 来存储项目中引用的确定类
信息
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">List of registered JDBC drivers</span>
<span style="color: #b9ca4a;">private</span> <span style="color: #b9ca4a;">final</span> <span style="color: #b9ca4a;">static</span> <span style="color: #7aa6da;">CopyOnWriteArrayList</span><span style="color: #8d5649;">&lt;</span><span style="color: #7aa6da;">DriverInfo</span><span style="color: #8d5649;">&gt;</span> <span style="color: #e7c547;">registeredDrivers</span> = <span style="color: #b9ca4a;">new</span> <span style="color: #7aa6da;">CopyOnWriteArrayList</span><span style="color: #8d5649;">&lt;&gt;()</span>;
</pre>
</div></li>
<li><p>
调用 <code>getConnection</code> 方法时通过变量所有注册的驱动来获取连接信息
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #969896; font-style: italic;">//  </span><span style="color: #969896; font-style: italic;">Worker method called by the public getConnection() methods.</span>
<span style="color: #b9ca4a;">private</span> <span style="color: #b9ca4a;">static</span> <span style="color: #7aa6da;">Connection</span> <span style="color: #e78c45;">getConnection</span><span style="color: #8d5649;">(</span>
    <span style="color: #7aa6da;">String</span> <span style="color: #e7c547;">url</span>, <span style="color: #7aa6da;">java</span>.<span style="color: #7aa6da;">util</span>.<span style="color: #7aa6da;">Properties</span> <span style="color: #e7c547;">info</span>, <span style="color: #7aa6da;">Class</span><span style="color: #d8241f;">&lt;</span>?<span style="color: #d8241f;">&gt;</span> <span style="color: #e7c547;">caller</span><span style="color: #8d5649;">)</span> <span style="color: #b9ca4a;">throws</span> <span style="color: #7aa6da;">SQLException</span> <span style="color: #8d5649;">{</span>
    <span style="color: #969896; font-style: italic;">/*</span>
<span style="color: #969896; font-style: italic;">     * When callerCl is null, we should check the application's</span>
<span style="color: #969896; font-style: italic;">     * (which is invoking this class indirectly)</span>
<span style="color: #969896; font-style: italic;">     * classloader, so that the JDBC driver class outside rt.jar</span>
<span style="color: #969896; font-style: italic;">     * can be loaded from here.</span>
<span style="color: #969896; font-style: italic;">     */</span>
    <span style="color: #7aa6da;">ClassLoader</span> <span style="color: #e7c547;">callerCL</span> = caller != <span style="color: #7aa6da;">null</span> ? caller.getClassLoader<span style="color: #d8241f;">()</span> : <span style="color: #7aa6da;">null</span>;
    <span style="color: #b9ca4a;">synchronized</span><span style="color: #d8241f;">(</span>DriverManager.<span style="color: #b9ca4a;">class</span><span style="color: #d8241f;">)</span> <span style="color: #d8241f;">{</span>
        <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">synchronize loading of the correct classloader.</span>
        <span style="color: #b9ca4a;">if</span> <span style="color: #9564bf;">(</span>callerCL == <span style="color: #7aa6da;">null</span><span style="color: #9564bf;">)</span> <span style="color: #9564bf;">{</span>
            callerCL = Thread.currentThread<span style="color: #24a222;">()</span>.getContextClassLoader<span style="color: #24a222;">()</span>;
        <span style="color: #9564bf;">}</span>
    <span style="color: #d8241f;">}</span>

    <span style="color: #b9ca4a;">if</span><span style="color: #d8241f;">(</span>url == <span style="color: #7aa6da;">null</span><span style="color: #d8241f;">)</span> <span style="color: #d8241f;">{</span>
        <span style="color: #b9ca4a;">throw</span> <span style="color: #b9ca4a;">new</span> <span style="color: #7aa6da;">SQLException</span><span style="color: #9564bf;">(</span><span style="color: #70c0b1;">"The url cannot be null"</span>, <span style="color: #70c0b1;">"08001"</span><span style="color: #9564bf;">)</span>;
    <span style="color: #d8241f;">}</span>

    println<span style="color: #d8241f;">(</span><span style="color: #70c0b1;">"DriverManager.getConnection(\""</span> + url + <span style="color: #70c0b1;">"\")"</span><span style="color: #d8241f;">)</span>;

    <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">Walk through the loaded registeredDrivers attempting to make a connection.</span>
    <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">Remember the first exception that gets raised so we can reraise it.</span>
    <span style="color: #7aa6da;">SQLException</span> <span style="color: #e7c547;">reason</span> = <span style="color: #7aa6da;">null</span>;

    <span style="color: #b9ca4a;">for</span><span style="color: #d8241f;">(</span><span style="color: #7aa6da;">DriverInfo</span> <span style="color: #e7c547;">aDriver</span> : registeredDrivers<span style="color: #d8241f;">)</span> <span style="color: #d8241f;">{</span>
        <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">If the caller does not have permission to load the driver then</span>
        <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">skip it.</span>
        <span style="color: #b9ca4a;">if</span><span style="color: #9564bf;">(</span>isDriverAllowed<span style="color: #24a222;">(</span>aDriver.driver, callerCL<span style="color: #24a222;">)</span><span style="color: #9564bf;">)</span> <span style="color: #9564bf;">{</span>
            <span style="color: #b9ca4a;">try</span> <span style="color: #24a222;">{</span>
                println<span style="color: #ff7f00;">(</span><span style="color: #70c0b1;">"    trying "</span> + aDriver.driver.getClass<span style="color: #1776b6;">()</span>.getName<span style="color: #1776b6;">()</span><span style="color: #ff7f00;">)</span>;
                <span style="color: #7aa6da;">Connection</span> <span style="color: #e7c547;">con</span> = aDriver.driver.connect<span style="color: #ff7f00;">(</span>url, info<span style="color: #ff7f00;">)</span>;
                <span style="color: #b9ca4a;">if</span> <span style="color: #ff7f00;">(</span>con != <span style="color: #7aa6da;">null</span><span style="color: #ff7f00;">)</span> <span style="color: #ff7f00;">{</span>
                    <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">Success!</span>
                    println<span style="color: #1776b6;">(</span><span style="color: #70c0b1;">"getConnection returning "</span> + aDriver.driver.getClass<span style="color: #00bed1;">()</span>.getName<span style="color: #00bed1;">()</span><span style="color: #1776b6;">)</span>;
                    <span style="color: #b9ca4a;">return</span> <span style="color: #1776b6;">(</span>con<span style="color: #1776b6;">)</span>;
                <span style="color: #ff7f00;">}</span>
            <span style="color: #24a222;">}</span> <span style="color: #b9ca4a;">catch</span> <span style="color: #24a222;">(</span><span style="color: #7aa6da;">SQLException</span> <span style="color: #e7c547;">ex</span><span style="color: #24a222;">)</span> <span style="color: #24a222;">{</span>
                <span style="color: #b9ca4a;">if</span> <span style="color: #ff7f00;">(</span>reason == <span style="color: #7aa6da;">null</span><span style="color: #ff7f00;">)</span> <span style="color: #ff7f00;">{</span>
                    reason = ex;
                <span style="color: #ff7f00;">}</span>
            <span style="color: #24a222;">}</span>

        <span style="color: #9564bf;">}</span> <span style="color: #b9ca4a;">else</span> <span style="color: #9564bf;">{</span>
            println<span style="color: #24a222;">(</span><span style="color: #70c0b1;">"    skipping: "</span> + aDriver.getClass<span style="color: #ff7f00;">()</span>.getName<span style="color: #ff7f00;">()</span><span style="color: #24a222;">)</span>;
        <span style="color: #9564bf;">}</span>

    <span style="color: #d8241f;">}</span>

    <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">if we got here nobody could connect.</span>
    <span style="color: #b9ca4a;">if</span> <span style="color: #d8241f;">(</span>reason != <span style="color: #7aa6da;">null</span><span style="color: #d8241f;">)</span>    <span style="color: #d8241f;">{</span>
        println<span style="color: #9564bf;">(</span><span style="color: #70c0b1;">"getConnection failed: "</span> + reason<span style="color: #9564bf;">)</span>;
        <span style="color: #b9ca4a;">throw</span> reason;
    <span style="color: #d8241f;">}</span>

    println<span style="color: #d8241f;">(</span><span style="color: #70c0b1;">"getConnection: no suitable driver found for "</span>+ url<span style="color: #d8241f;">)</span>;
    <span style="color: #b9ca4a;">throw</span> <span style="color: #b9ca4a;">new</span> <span style="color: #7aa6da;">SQLException</span><span style="color: #d8241f;">(</span><span style="color: #70c0b1;">"No suitable driver found for "</span>+ url, <span style="color: #70c0b1;">"08001"</span><span style="color: #d8241f;">)</span>;
<span style="color: #8d5649;">}</span>
</pre>
</div></li>
<li>打破双亲委派
<ul class="org-ul">
<li><p>
由于 <code>java.sql.Driver</code> 的类加载器是 Bootstrap ClassLoader, 而实际加载三
方实现类的 <code>Launcher.AppClassLoader.getAppClassLoader(var1);</code> 方法的线程
上下文应该是 <code>AppClassLoader</code>, 这违背了双亲委派模型
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #b9ca4a;">public</span> <span style="color: #b9ca4a;">class</span> <span style="color: #7aa6da;">Launcher</span> <span style="color: #8d5649;">{</span>
    <span style="color: #b9ca4a;">private</span> <span style="color: #b9ca4a;">static</span> <span style="color: #7aa6da;">URLStreamHandlerFactory</span> <span style="color: #e7c547;">factory</span> = <span style="color: #b9ca4a;">new</span> <span style="color: #7aa6da;">Launcher</span>.<span style="color: #7aa6da;">Factory</span><span style="color: #d8241f;">()</span>;
    <span style="color: #b9ca4a;">private</span> <span style="color: #b9ca4a;">static</span> <span style="color: #7aa6da;">Launcher</span> <span style="color: #e7c547;">launcher</span> = <span style="color: #b9ca4a;">new</span> <span style="color: #7aa6da;">Launcher</span><span style="color: #d8241f;">()</span>;
    <span style="color: #b9ca4a;">private</span> <span style="color: #b9ca4a;">static</span> <span style="color: #7aa6da;">String</span> <span style="color: #e7c547;">bootClassPath</span> = System.getProperty<span style="color: #d8241f;">(</span><span style="color: #70c0b1;">"sun.boot.class.path"</span><span style="color: #d8241f;">)</span>;
    <span style="color: #b9ca4a;">private</span> <span style="color: #7aa6da;">ClassLoader</span> <span style="color: #e7c547;">loader</span>;
    <span style="color: #b9ca4a;">private</span> <span style="color: #b9ca4a;">static</span> <span style="color: #7aa6da;">URLStreamHandler</span> <span style="color: #e7c547;">fileHandler</span>;

    <span style="color: #b9ca4a;">public</span> <span style="color: #b9ca4a;">static</span> <span style="color: #7aa6da;">Launcher</span> <span style="color: #e78c45;">getLauncher</span><span style="color: #d8241f;">()</span> <span style="color: #d8241f;">{</span>
        <span style="color: #b9ca4a;">return</span> launcher;
    <span style="color: #d8241f;">}</span>

    <span style="color: #b9ca4a;">public</span> <span style="color: #e78c45;">Launcher</span><span style="color: #d8241f;">()</span> <span style="color: #d8241f;">{</span>
        <span style="color: #7aa6da;">Launcher</span>.<span style="color: #7aa6da;">ExtClassLoader</span> <span style="color: #e7c547;">var1</span>;
        <span style="color: #b9ca4a;">try</span> <span style="color: #9564bf;">{</span>
            var1 = <span style="color: #7aa6da;">Launcher</span>.ExtClassLoader.getExtClassLoader<span style="color: #24a222;">()</span>;
        <span style="color: #9564bf;">}</span> <span style="color: #b9ca4a;">catch</span> <span style="color: #9564bf;">(</span><span style="color: #7aa6da;">IOException</span> <span style="color: #e7c547;">var10</span><span style="color: #9564bf;">)</span> <span style="color: #9564bf;">{</span>
            <span style="color: #b9ca4a;">throw</span> <span style="color: #b9ca4a;">new</span> <span style="color: #7aa6da;">InternalError</span><span style="color: #24a222;">(</span><span style="color: #70c0b1;">"Could not create extension class loader"</span>, var10<span style="color: #24a222;">)</span>;
        <span style="color: #9564bf;">}</span>

        <span style="color: #b9ca4a;">try</span> <span style="color: #9564bf;">{</span>
            <span style="color: #b9ca4a;">this</span>.loader = <span style="color: #7aa6da;">Launcher</span>.AppClassLoader.getAppClassLoader<span style="color: #24a222;">(</span>var1<span style="color: #24a222;">)</span>;
        <span style="color: #9564bf;">}</span> <span style="color: #b9ca4a;">catch</span> <span style="color: #9564bf;">(</span><span style="color: #7aa6da;">IOException</span> <span style="color: #e7c547;">var9</span><span style="color: #9564bf;">)</span> <span style="color: #9564bf;">{</span>
            <span style="color: #b9ca4a;">throw</span> <span style="color: #b9ca4a;">new</span> <span style="color: #7aa6da;">InternalError</span><span style="color: #24a222;">(</span><span style="color: #70c0b1;">"Could not create application class loader"</span>, var9<span style="color: #24a222;">)</span>;
        <span style="color: #9564bf;">}</span>

        Thread.currentThread<span style="color: #9564bf;">()</span>.setContextClassLoader<span style="color: #9564bf;">(</span><span style="color: #b9ca4a;">this</span>.loader<span style="color: #9564bf;">)</span>;
        <span style="color: #7aa6da;">String</span> <span style="color: #e7c547;">var2</span> = System.getProperty<span style="color: #9564bf;">(</span><span style="color: #70c0b1;">"java.security.manager"</span><span style="color: #9564bf;">)</span>;
        <span style="color: #b9ca4a;">if</span> <span style="color: #9564bf;">(</span>var2 != <span style="color: #7aa6da;">null</span><span style="color: #9564bf;">)</span> <span style="color: #9564bf;">{</span>
            <span style="color: #7aa6da;">SecurityManager</span> <span style="color: #e7c547;">var3</span> = <span style="color: #7aa6da;">null</span>;
            <span style="color: #b9ca4a;">if</span> <span style="color: #24a222;">(</span><span style="color: #7aa6da;">!</span><span style="color: #70c0b1;">""</span>.equals<span style="color: #ff7f00;">(</span>var2<span style="color: #ff7f00;">)</span> &amp;&amp; <span style="color: #7aa6da;">!</span><span style="color: #70c0b1;">"default"</span>.equals<span style="color: #ff7f00;">(</span>var2<span style="color: #ff7f00;">)</span><span style="color: #24a222;">)</span> <span style="color: #24a222;">{</span>
                <span style="color: #b9ca4a;">try</span> <span style="color: #ff7f00;">{</span>
                    var3 = <span style="color: #1776b6;">(</span><span style="color: #7aa6da;">SecurityManager</span><span style="color: #1776b6;">)</span><span style="color: #b9ca4a;">this</span>.loader.loadClass<span style="color: #1776b6;">(</span>var2<span style="color: #1776b6;">)</span>.newInstance<span style="color: #1776b6;">()</span>;
                <span style="color: #ff7f00;">}</span> <span style="color: #b9ca4a;">catch</span> <span style="color: #ff7f00;">(</span><span style="color: #7aa6da;">IllegalAccessException</span> <span style="color: #e7c547;">var5</span><span style="color: #ff7f00;">)</span> <span style="color: #ff7f00;">{</span>
                <span style="color: #ff7f00;">}</span> <span style="color: #b9ca4a;">catch</span> <span style="color: #ff7f00;">(</span><span style="color: #7aa6da;">InstantiationException</span> <span style="color: #e7c547;">var6</span><span style="color: #ff7f00;">)</span> <span style="color: #ff7f00;">{</span>
                <span style="color: #ff7f00;">}</span> <span style="color: #b9ca4a;">catch</span> <span style="color: #ff7f00;">(</span><span style="color: #7aa6da;">ClassNotFoundException</span> <span style="color: #e7c547;">var7</span><span style="color: #ff7f00;">)</span> <span style="color: #ff7f00;">{</span>
                <span style="color: #ff7f00;">}</span> <span style="color: #b9ca4a;">catch</span> <span style="color: #ff7f00;">(</span><span style="color: #7aa6da;">ClassCastException</span> <span style="color: #e7c547;">var8</span><span style="color: #ff7f00;">)</span> <span style="color: #ff7f00;">{</span>
                <span style="color: #ff7f00;">}</span>
            <span style="color: #24a222;">}</span> <span style="color: #b9ca4a;">else</span> <span style="color: #24a222;">{</span>
                var3 = <span style="color: #b9ca4a;">new</span> <span style="color: #7aa6da;">SecurityManager</span><span style="color: #ff7f00;">()</span>;
            <span style="color: #24a222;">}</span>

            <span style="color: #b9ca4a;">if</span> <span style="color: #24a222;">(</span>var3 == <span style="color: #7aa6da;">null</span><span style="color: #24a222;">)</span> <span style="color: #24a222;">{</span>
                <span style="color: #b9ca4a;">throw</span> <span style="color: #b9ca4a;">new</span> <span style="color: #7aa6da;">InternalError</span><span style="color: #ff7f00;">(</span><span style="color: #70c0b1;">"Could not create SecurityManager: "</span> + var2<span style="color: #ff7f00;">)</span>;
            <span style="color: #24a222;">}</span>

            System.setSecurityManager<span style="color: #24a222;">(</span>var3<span style="color: #24a222;">)</span>;
        <span style="color: #9564bf;">}</span>

    <span style="color: #d8241f;">}</span>

  <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">&#30465;&#30053;</span>
<span style="color: #8d5649;">}</span>
</pre>
</div></li>
<li>JDBC 4.0 之前使用 <code>Class.forName("")</code> 方式加载驱动是不会破坏双亲委派的，
JDBC 4.0 之后使用 SPI 机制才会破坏双亲委派机制</li>
<li>Bootstrap ClassLoader 和 Extension ClassLoader, 他们只能加载自己指定目录
下的类，无法加载运行时的，其他目录下的类</li>
<li>JDBC 接口都是由 JDK 提供，具体实现是由第三方数据库产商提供的,所以也只能
采用这种方式去加载驱动实现类</li>
</ul></li>
</ol>
</div>
</div>
</div>
